Tekla Open API Reference for Tekla Structures 2025
DistanceList.Item Property
 Gets or sets the item at the specified index.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Distance this[
	int index
] { get; set; }
Public Default Property Item (
	index As Integer
) As Distance
	Get
	Set
Parameters
index
Type: System.Int32
The index of an item in the list.
Return Value
Type: Distance
The item at the specified index.
Implements
IList<T>.Item[Int32]
Examples
 This example shows how to access the Distance instances in a DistanceList by index.
using Tekla.Structures.Datatype;
public class Example
{
       public void Example1()
       {
           // We'll use this distance list to demonstrate how to access and then
           // modify items using an index.
           DistanceList distanceList = new DistanceList(new Distance[]
                                                       {
                                                           new Distance(30.2),
                                                           new Distance(30.2),
                                                           new Distance(30.2),
                                                           new Distance(50),
                                                           new Distance(2.3),
                                                           new Distance(2.3),
                                                       });
           for(int i = 0; i < distanceList.Count; i++)
           {
               Distance item = distanceList[i];
               // Modify the item here.
               distanceList[i] = item;
           }
       }
}
See Also
Reference
DistanceList Structure
Tekla.Structures.Datatype Namespace